{
  "nour": " اسم علم مذكر ومؤنث، ومعناه: الضوء، الضياء، الوسم،أو حُسن النبات وطوله.",
  "amal": " اسم علم عربي مؤنث، الرجاء، الأمنية، الطموح، التطلع، وجمعه آمال",
  "shathaa": "اسم علم مؤنث عربي، وهو واوي. والشذا: ريح المسك، المسك، قوَّة الرائحة.",
  "alaa": "اسم علم مذكر عربي، معناه: العلوّ، الرفعة، الشرف، المجد، المقام العالي.",
  "hamdi": "اسم علم مذكر عربي، منسوب إلى الحمد وهو الشكر والثناء، لعله منقول عن التركية",
  "karam": "هو اسم علم شخصي مذكر عربي، معنى اسمه هو الفضل أو السخاء.",
  "mohanned": "اسم علم مذكر عربي، معناه: السيف القاطع المصنوع من حديد الهند.",
  "aya": "اسم علم مؤنث عربي، معناه:المعجزة، العلامة الخارقة للإنسان، الرسالة، العِبْرة.",
  "abeer": "اسم علم مؤنث عربي، معناه: أخلاط الطيب مع الزعفران، الزعفران وحده، الرائحة لطيبة، العطر الفائح.",
  "mohammed": "اسم علم مذكر عربي، معناه: المحمود الخصال، المثني عليه، المشكور، المرضيُّ الأفعال.",
  "khaled": "اسم علم مذكر عربي، على صيغة اسم الفاعل من الفعل خَلَدَ، إذا دام.",
  "heleena": "اسم علم مؤنث كردي، معناه: العشّ. أو هو يوناني انظر: هِلن.",
  "haitham": " اسم علم مذكر عربي، معناه: الصقر، فرخ الصقر، فرخ النسر، فرخ العقاب، الرملة الحمراء، الأرض الناعمة. ",
  "eman": "اسم علم مؤنث عربي، عقيدة وتصديق.",
  "abdallah": "اسم علم مذكر عربي، مركب بالإضافة. والله: الاسم الخالص له تعالى. ",
  "raghda": "اسم علم مؤنث عربي، هو ترخيم الاسم رغداء وتخفيفه نطقاً (انظره).",
  "momen": "اسم علم مذكر عربي، وهو اسم مفعول من الفعل آمنَ. معناه: المصدِّق، التام الإيمان، الذي هداه الله.",
  "yaser": " اسم علم شخصي مذكر عربي معناه السهل أو الجزار أو من يتولى قسمة جزور الميسر.",
  "farah": "اسم علم مؤنث معناه: السرور ، انشراح الصدور ، البهجة ، السعادة",
  "basel": "باسل هو اسم علم مذكر من أصل عربي، وجاء الاسم على صيغة الفاعل، ومعناه هو الشجاع والشديد والأسد",
  "heba": "العطية، الهدية، ما تعطيه من غير مطالبة بعوض",
  "nada": "ندى اسم علم مؤنث عربي: أصله ومعناه: الطل، البلل الذي يبدو على الأزهار صباحاً، وقد يعني الندى: الجود، الكرم، المطر، الكلأ، نوع من البخور",
  "lina": "النخلة، النخلة الكريمة، كل شيء من النخلة سوى العجوة",
  "adham": " اسم علم مذكر عربي، معنى اسمه هو الفضل أو السخاء",
  "moustafa": "مُصطفى هو اسم عربي شائع يعني المختار، ومن الشخصيات التي حملت هذا الاسم: من ألقاب نبي الإسلام محمد بن عبد الله",
  "shams": "من الأسماء ذات المعاني الجميلة، فيأتي أيضًا بمعنى نور وإشراقة",
  "omar": "والاسم مشتق من العُمْر وهو الحياة؛ يسمى به تفاؤلاً على العمر المديد للمولود",
  "abdlraheem": "اسم علم مذكر عربي، مركب بالإضافة. والرحيم: هو الله صفة له، وصفة لعباده، على عكس الرحمن الصفة الخاصة به. والرحيم: الكثير الرحمة والعطف والشفقة",
  "hakim": "وهو صفة مشبهة بمعنى: الفيلسوف، الطبيب، المحكم من الأمور، المتقن للأشياء",
  "fadi": "الذي يفديك وينقذك بروحه أو بكل ثمين عنده",
  "aseel": " يعني اللينة والملساء، ومؤنثه أسيله، ومعناه السهل الناعم اللين",
  "oday": "عدي هو اسم علم مذكر من أصل عربي، ومعناه هو دلالة على العصيان والتمرد",
  "yusuf": "اسم علم مذكر عبري توراتي ، وهو يعني منح الله وعطاءه",
  "mohannad": "مهند هو اسم من أسماء السيوف المطبوعة من حديد الهند. وهو اسم مذكر عربي",
  "anes": "اسم علم مذكر عربي، من الأنس ضد الوحشة. والأنيس: المؤانس، اللطيف، الملاطف، النديم، مَن يحسن ملاطفة النساء، المأنوس، الهادئ الطبع."
}
